Notebook purpose

- Build tags following muggleton2021evidence

In [2]:
import os
import sys
import numpy as np
import pandas as pd
sys.path.append('/Users/fgu/dev/projects/entropy')
import entropy.helpers.aws as aws
import entropy.data.cleaners as cl
import entropy.data.creators as cr

pd.set_option('display.max_rows', 120)
pd.set_option('display.max_columns', 120)
pd.set_option('max_colwidth', None)

pd.set_option('display.max_seq_items', None)


%config InlineBackend.figure_format = 'retina'
%load_ext autoreload
%autoreload 2

In [3]:
SAMPLE = 'X77'
fp = f'~/tmp/entropy_{SAMPLE}.parquet'

df = aws.read_parquet(fp)
df.head(2)

,id,date,user_id,amount,desc,merchant,tag,user_female,user_postcode,user_registration_date,user_salary_range,user_yob,account_created,account_id,account_last_refreshed,account_provider,account_type,data_warehouse_date_created,data_warehouse_date_last_updated,debit,latest_balance,merchant_business_line,tag_auto,tag_manual,tag_up,ym,balance,income
0,688261,2012-01-03,777,400.00,<mdbremoved> - s/o,NaN,transfers,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2017-11-13,True,364.220001,non merchant mbl,transfers,other account,other account,201201,-1451.075562,24319.220881
1,688264,2012-01-03,777,10.27,"9572 30dec11 , mcdonalds , restaurant , winwick road gb - pos",mcdonalds,dining and drinking,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2015-03-19,True,364.220001,mcdonalds,dining and drinking,NaN,dining and drinking,201201,-1451.075562,24319.220881

In [52]:
dd = cl.add_tag(df)
dd = cl.add_tag_group(df)
dd.tag.value_counts(dropna=False)

household        265313
NaN              258998
services         252726
transfer         158109
finance           78620
other_spend       72262
retail            64611
travel            62251
communication     31422
earnings          13913
hobbies           12136
benefits          10248
motor              8277
other_income       7680
pensions           1844
savings            1467
Name: tag, dtype: int64

In [46]:
df

258998

In [27]:
df.tag_group.value_counts(dropna=False)

spend       849052
NaN         258998
transfer    159576
income       32251
Name: tag_group, dtype: int64